app/controllers/item_controller.rb

SELECT * FROM `items` WHERE (`items`.`id` = 1)
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def show
    @item = Item.find(params[:id])
    @customer = Customer.find(@item.customer_id)